run/ampFsiFoam/axisymmetricTube/fluid/0/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | Web:      http://www.OpenFOAM.org               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    inlet
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    interface-fluid
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    wedge_p
    {
        type wedge;
    }
    wedge_n
    {
        type wedge;
    }
}


// ************************************************************************* //
