run/ampFsiFoam/axisymmetricTube/fluid/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidPatch interface-solid;
solidZone interface-solid-zone;


fluidPatch interface-fluid;
fluidZone interface-fluid-zone;

//movingRegion region0;

fsiRelaxationFactor 0.025;

interfaceDeformationLimit 0;

outerCorrTolerance 1e-6;
nOuterCorr 40;


//couplingScheme Aitken;
couplingScheme IQN-ILS;

couplingReuse       0;

fsi yes;

// ************************************************************************* //
